org/blog.org
:CONFIG:
#+hugo_base_dir: ../
#+seq_todo: TODO DRAFT DONE
#+options: creator:t
#+macro: updatetime {{{time(%B %e\, %Y)}}}
#+hugo_auto_set_lastmod: t
#+startup: hidestars
#+startup: overview
#+startup: logdone
# #+startup: inlineimages
# #+startup: latexpreview
:END:

#+title: Blog Source File
#+author: Prashant Tak

** Japanese Resources :noexport:
   :PROPERTIES:
   :EXPORT_FILE_NAME: japanese-guide
   :END:
*** JPod101
    Add a nice collection of their videos and cheatsheet materials since most sources don't really tell much about their actual content.
*** Hiragana
    + Why? All other basic textbooks have as requirement, romaji as a crutch that hurts later on
    + Tofugu Guide
    + Tae Kim Quiz
*** Katakana
    + Important thing to not delay learning it even when other sources say so.
    + TODO Add sources and more info
*** Kanji + Grammar + Vocabulary
**** Intro
     + Important step because after crossing the initial simple hurdle you're presented with a mammoth choice.
     + Genki - Mention ToKini
     + Grammar - Use genki before Tae Kim??
     + Kanji - Can I promote WaniKani Anki Deck???
     + Vocabulary
     + Readings - Tofugu article
**** Tango N5 deck
     | 彼   | Kare   | He   |
     | 彼女 | Kanojo | She  |
     | 名前 | Namae  | Name |
     |      |        |      |

*** Grammar Points
**** Verb Conjugation
     Start with misa's video then watch Andy's.
**** Particles (Do after conjugation!)
     + =は= (pronounced as wa): TOPIC MARKER- It marks the topic of a clause and creates focus. Translation: /as for, speaking of/. It can also be use as a CONTRASTING MARKER where =demo= acts as /but/ For example, I eat bread, *but* I *don't* eat butter. Here the topics bread and butter would be followed by the topic marker. =kore= means /this/ can can be just as a pointer for distinguishing an object
     + =ga=: SUBJECT PARTICLE- Since it denotes existence, it is generally used with =arimasu= and =imasu= (for animate things) meaning (/to have/ or /to exist/) There existence copulas can be negated by turning =su= to =sen=. It can be used as a DESIRE MARKER: `S + O + =ga= + Adjective of desire` for example =hoshii desu= which is /(I) want/ or `Stem of verb + =tai desu= ` which is /[I] want to [verb]/.
*** Pitch Accent
- Playlist
- My notes
- kotu.io

*** Bunpro
**** N5
***** Level 1
      1. da:
         + to be/is
         + Do not use with i-adj. (Cure Dolly video)
         + Noun+da
         + na-adj+da
         + Casual
      2. desu:
         + to be/is
         + Can be used with both na/i-adj
         + Noun/Adj + desu
         + Polite version of da
      3. wa(ha):
         + denotes the .... (use notes from text)
         + Sentence Topic + wa
         + Emphasizes what comes after it unlike ga.
         + ....
      4. mo:
         + also, too as well
         + Noun + mo
         + atashi mo. (me too)
         + Kore mo sensei desu. (He is also a teacher)
      5. kore:
         + this
         + kore wa penn desu.
         + kore mo hitsyoo desu. (This is also necessary)
      6. no:
         + indicates possession
         + Noun 1 + no + Noun 2
         + これも私のペンです。 (This is also my pen)
      7. ii:
         + adjective meaning "good"
         |          | Present | Past        |
         | Postive  | ii      | yokatta     |
         | Negative | yokunai | yokunakatta |
         + yoku also means "frequently/often" be careful
         + テストは、よくなかった。(Test was not good)
      8. ka:
         + question particle
         + Phrase + ka
         + 明日もいいですか。(ashita) (Is tomorrow also good?)
***** Level 2
      1. deshoo:
         + right? probably
         + Asking for confirmation
         + Noun/Verb/Adj + deshyoo
         + 明日も雨でしょう。 (ashita, ame) (It will also probably rain tomorrow)
      2. ga:
         + Subject marker identifier
         + Subject + ga
         + Denotes who or what performed the action, emphasizes what came before it
      3. sore:
         + that
         + それもいいです。(That is also good.)
      4. ru-verbs/Ichidan verbs:
         | Conjugation | Casual      | Polite           |
         | Present     | taberu      | tabemasu         |
         | Past        | tabeta      | tabmashita       |
         | Negative    | tabenai     | tabemasen        |
         | Neg. Past   | tabenakatta | tabemasendeshita |
      5. gaaru:
         + To be/ There is
         + Polite form: gaarimasu
         + Noun + gaaru
         + For non-living things
         + Ga is often omitted in casual speech
      6. koko:
         + here/ this place
         + (Near the speaker)
      7. to:
         + and/ with
         + Noun + to + Noun/Verb
         + When listing nouns, to: exhaustive, ya: non-exhaustive
      8. ~ ndesu.nodesu
         +

*** Anki Deck Sequence:
1. Hiragana Deck
2. Katakana Deck
3. Katakana Sentences
4. Kanji Deck: Either RTK order Allinone or WaniKani? or Kanji deck by [[https://sites.google.com/view/jo-mako/home][Jo Mako]]
5. Grammar Deck: Jo Mako
6. Vocabulary: Tango decks + JP1K + Kanji in context
